Repository: tomasara413/URLServerManager
Catalog: Properties/Resources.*.resx
Languages: cs_cz

# AdditionalParameters
source: Additional paramaters
cs_cz: Dodatečné parametry

source: Application
cs_cz: Aplikace

source: Category
cs_cz: Kategorie

source: Description
cs_cz: Popis

source: Edit server
cs_cz: Upravit server

source: Exit
cs_cz: Konec

source: Export
cs_cz: Exportovat

source: FQDN
cs_cz: PKDJ

source: Import
cs_cz: Importovat

source: New server
cs_cz: Nový server

source: New server structure
cs_cz: Nová struktura serverů

# OFDSelectFile
source: Choose a file with servers structure
cs_cz: Vyberte soubor se strukturou serverů

# OpenLocal
source: Open local structure
cs_cz: Otevřít místní zálohu

# OpenRemote
source: Open remote structure
cs_cz: Otevřít vzdálenou zálohu

# RemoveServer
source: Delete server
cs_cz: Smazat server

source: Settings
cs_cz: Nastavení

# SFDFileSavingProcedure
source: Choose a destination and a file name
cs_cz: Vyberte umístění a zadejte jméno souboru

# SQLiteDBFile
source: SQLite database file
cs_cz: Soubor databáze SQLite

# SyncRemote
source: Synchronize local with remote
cs_cz: Synchronizovat místní a vzdálenou zálohu

source: Tools
cs_cz: Nástroje

source: XML structure file
cs_cz: Soubory se strukturou serverů ve formátu XML

source: Category Associations
cs_cz: Asociace kategorií

source: General
cs_cz: Hlavní

source: Protocol associations
cs_cz: Asociace protokolů

source: Cancel
cs_cz: Zrušit

# LocalLocation
source: Path to local file
cs_cz: Cesta k místní záloze

# RemoteLocation
source: Path to remote file
cs_cz: Cesta k vzdálené záloze

source: Apply
cs_cz: Aplikovat

# FileDoesNotExist
source: This file does not exist
cs_cz: Tento soubor neexistuje

source: Font size
cs_cz: Velikost písma

# FontSizeTooLarge
source: Specified font size is too large (the largest value is used).
cs_cz: Specifikovaná velikost písma je moc velká (je použita nejvyšší možná hodnota).

# FontSizeTooSmall
source: Specified font size is too small (the lowest value is used).
cs_cz: Specifikovaná velikost písma je moc malá (je použita nejnižší možná hodnota).

# FontSizeNull
source: Font size is not specified (the default or saved value is used).
cs_cz: Velikost písma není specifikovaná (je použita výchozí nebo uložená hodnota).

# ShowLocalModifiers
source: Show modification indicators
cs_cz: Zobrazit indikátory změn

# ShowLocalModifiersToolTip
source: Shows local modification indicators (available only with remote server file set).
cs_cz: Zobrazí modifikátory místních změn (dostupné pouze při nastavení cesty k vzdálené záloze).

# AllowPortAvailabilityDiagnostics
source: Allow diagnostics of port availability
cs_cz: Povolit zjištění dostupnosti portů

# Miliseconds
source: Time in miliseconds (ms)
cs_cz: Čas v milisekundách (ms)

source: Timeout
cs_cz: Časový limit

# AssociationsTip
source: While adding an association, write the startup argument into the input field and replace the ip and port variable with {address} and {port}. This is usually follows this format: "<command/protocol> <remote IP endpoint>:<port>". An example for a program Putty: -ssh {address} -P {port}
cs_cz: Při přidávání asociace do kolonky spouštěcí parametr vpište příkaz a adresu s portem nahraďte značením {address} a {port}. Tento paramter je obyčejně ve tvaru: "<příkaz/protokol> <IP vzdáleného uzlu>:<port>". Příklad parametru pro program putty: -ssh {address} -P {port}

# Renew
source: Renew time
cs_cz: Čas obnovení

# RenewNull
source: Renew value is not specified (the default or saved value is used).
cs_cz: Hodnota času obnovení není specifikována (je použita výchozí nebo uložená hodnota).

# RenewTooSmall
source: Specified renew is too small (the lowest value is used).
cs_cz: Specifikovaná hodnota času obnovení je moc malá (nejmenší možná hodnota použita).

# TimeoutNull
source: Timeout value is not specified (the default or saved value is used).
cs_cz: Hodnota časového limut není specifikována (je použita výchozí nebo uložená hodnota).

# TimeoutTooSmall
source: Specified timeout value is too small (the lowest value is used).
cs_cz: Specifikovaná hodnota časového limitu je moc malá (nejmenší možná hodnota použita).

source: Protocols
cs_cz: Protokoly

# PortAssociations
source: Port asscociations
cs_cz: Asociace portů

# ProgramAssociation
source: Protocol to Program Association
cs_cz: Asociace Programu a Protokolu

# ExecutableFilePath
source: Path to executable file
cs_cz: Cesta k spustitelnému souboru

source: Protocol
cs_cz: Protokol

source: Cmd parameters
cs_cz: Cmd parametry

source: other...
cs_cz: jiné...

source: Add
cs_cz: Přidat

source: Edit
cs_cz: Upravit

source: Executable files
cs_cz: Spustitelné soubory

# PortAssociation
source: Protocol to Port Association
cs_cz: Asociace Portu a Protokolu

source: HTML notation
cs_cz: Notace HTML

source: Current color
cs_cz: Současná barva

# ProtocolAssociation
source: Program's Start Arguments
cs_cz: Argumenty Při Spuštění Programu

source: Add other protocol
cs_cz: Přidat jiný protokol

# OtherProtocolName
source: Name of the protocol
cs_cz: Název protokolu

source: Border color
cs_cz: Barva ohraničení

source: Background color
cs_cz: Barva pozadí

source: Text color
cs_cz: Barva textu

# CategoryColorDefined
source: Default category color is already defined.
cs_cz: Výchozí barva kategorie je již definována

# CategoryColorAssociation
source: Category and color association
cs_cz: Asociace kategorie a barvy

source: Addresses
cs_cz: Adresy

source: Add other category
cs_cz: Přidat další kategorii

# OtherCategoryName
source: Name of the category
cs_cz: Jméno kategorie

source: Use
cs_cz: Použít

source: IP Address
cs_cz: IP Adresa

source: Address
cs_cz: Adresa

# DefaultProtocolAlreadyPresent
source: Default protocol is already present. To proceed with this action edit the association or delete it. (Ports added by the application cannot be changed).
cs_cz: Výchozí protokol je již přítomen. Chcete-li pokračovat v této akci, upravte přítomnou asociaci nebo ji smažte. (Porty přidané aplikací nemohou být upraveny).

# DuplicateProtocolEntries
source: Duplicate entries have been found inside the list, please check for duplicates and remove all the invalid ones. (Only the first entry of one protocol will be saved)
cs_cz: Byly nalezeny duplicitní záznamy, prosím zkontrolujte seznam a odstraňte neplatné záznamy. (Pouze první přítomný záznam daného protokolu bude uložen)

# AddressCannotBeEmpty
source: Address field cannot be empty.
cs_cz: Pole adresy nesmí být prázdné.

source: Protocol cannot be empty.
cs_cz: Musí být zvolen platný protokol.

# UnableToResolveOrParse
source: Unable to resolve or parse the specified address. Please, check if the address has been entered correctly. (The address will be saved, but the connection might fail)
cs_cz: Nebylo možné dohledat nebo zparsovat zadanou adresu, prosím zkontrolujte, že byla zadána správně. (Adresa bude uložena, ale následné připojení může selhat)

# PortUnassociatedAndEmpty
source: Selected protocol has no associated port with it, therefor it is necessary to enter port number (port cannot be empty).
cs_cz: Vybraný protokol nemá asociovaný port, proto je nutné zadat číslo portu (pole port nemůže být prázdné).

# RemoveServerMessage
source: Are you sure you want to remove the server?
cs_cz: Opravdu chcete smazat server?

# AssociateMessage
source: You have not yet associated this protocol to program, would you like to do it now?
cs_cz: Zvolený protokol k sobě ještě nemá přiřazen žádný program, chcete ho přiřadit nyní?

source: Program Selection
cs_cz: Výběr Programu

source: Select
cs_cz: Vybrat

source: Language
cs_cz: Jazyk

source: New cluster
cs_cz: Nový cluster

source: Open Watcher
cs_cz: Otevřít Hlídkaře

# VirtualizationServerWindow
source: Virtualization Server
cs_cz: Virtualizační Server

# Remove
source: Delete
cs_cz: Odstranit

source: New virtualization server
cs_cz: Nový virtualizační server

source: Is virtual
cs_cz: Je virtuální

# VirtualServerSwitch
source: Under current settings (this server being a virtualization server) all servers in collection currently listed as physical machines need to be virtual. This will be handled automatically. Do you wish to proceed with this action?
cs_cz: Za momentální situace (kdy je tento server virtualizačním serverem) musí být všechny servery uvedené v kolekci jako fyzické stroje přepnuty na virtuální. Toto se provede automaticky. Chcete s touto akcí pokračovat?

# VirtualServerSwitchCaption
source: Virtual server switch
cs_cz: Přepnutí virtuálního serveru

# ElevateProcess
source: To access this directory, you need to launch this application as an administrator. Do you want to elevate this process?
cs_cz: Pro přístup do zvoleného adresáře je třeba administrátorského oprávnění. Chcete tomuto procesu zvýšit oprávnění?

# ElevateProcessCaption
source: Elevate process
cs_cz: Spustit jako správce

source: CSV structure file
cs_cz: Soubory se strukturou serverů ve formátu CSV

source: JSON structure file
cs_cz: Soubory se strukturou serverů ve formátu JSON

# CSVImportDialog
source: Import from CSV file
cs_cz: Import ze souboru typu CSV

# CSVImportDialogMessage
source: For a valid import from csv files thre are 4 files required, after an export from this application these files are called: *-servers.csv; *-addresses.csv; *-serverContents.csv and *-defaultCategories. If the import is to be proceed with without any issues, all required files need to be specified. Fileds marked with * have to be filled in otherwise the import cannot proceed.
cs_cz: Pro korektní import souborů csv jsou třeba 4 soubory, tyto soubory se po exportu z této aplikace jmenují *-servers.csv; *-addresses.csv; *-serverContents.csv a *-defaultCategories. Pokud má import proběhnout zcela úspěšně, je třeba uvést všechny soubory. Pole označená * je třeba vyplnit neboť se bez nich import neobejde.

# WatcherWindow
source: Watcher
cs_cz: Hlídkař

source: Address unreachable
cs_cz: Adresa je nedosažitelná

source: DNS Entry not found
cs_cz: Záznam nebyl nalezen v DNS

source: Port not responding
cs_cz: Port neodpovídá

source: Untested
cs_cz: Netestováno

# NotValidDestinationAddress
source: This address is not a valid source address.
cs_cz: Tato adresa není validní koncová adresa.

# FindHeader
source: Find
cs_cz: Najít

source: Match exactly
cs_cz: Přesná shoda

source: Search for
cs_cz: Hledat

source: Synchronize
cs_cz: Synchronizovat

source: Please wait
cs_cz: Počkejte prosím

# RemoteMySQLDatabase
source: Remote MySQL database specification
cs_cz: Specifikace vzdálené databáze MySQL

source: Database name
cs_cz: Jméno databáze

# DownloadDefaultColorsOnly
source: Download only remote default colors.
cs_cz: Stáhnout pouze výchozí barvy.

# DownloadEntitiesOnly
source: Download only remote structures.
cs_cz: Stáhnout pouze vzdálené struktury.

# DownloadToFullSync
source: Do not send data, but fully synchronize.
cs_cz: Pouze plně synchronizovat.

source: Send data and fully synchronize.
cs_cz: Odeslat data a plně synchronizovat.

# SendDefaultColorsOnly
source: Send only default colors.
cs_cz: Odeslat pouze výchozí barvy.

source: Password
cs_cz: Heslo

source: User ID
cs_cz: ID Uživatele

# MySQLLoginData
source: MySQL Credentials
cs_cz: Přihlašovací údaje do MySQL databáze

# SynchronizationConflictResolutionWindowTitle
source: Synchronization - conflicts
cs_cz: Synchronizace - konflikty

# SynchronizationConnectionWindowTitle
source: Synchronization - connection
cs_cz: Synchronizace - připojení

# SynchronizationLoginPopupTitle
source: Synchronization - login
cs_cz: Synchronizace - přihlášení

# SynchronizationFailed
source: Synchronization failed, error:
cs_cz: Synchronizace selhala, chyba:

source: Synchronization Failure
cs_cz: Synchronizační Selhání

source: Synchronization Success
cs_cz: Synchronizační Úspěch

# SynchronizationSuccessful
source: Synchronization was sucessful.
cs_cz: Synchronizace byla úspěšná.

source: Resolve
cs_cz: Vyřešit

source: Keep
cs_cz: Ponechat

# ThrowAway
source: Replace
cs_cz: Nahradit

source: Show details view
cs_cz: Zobrazit podokno detailů
